{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "450"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/global_avg_pooling_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "450"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "450"}]}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/clip_by_value/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/sequential_5_1/embedding_layer_1/Cast", "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/sub"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/clip_by_value", "op": "Maximum", "input": ["StatefulPartitionedCall/sequential_5_1/embedding_layer_1/clip_by_value/Minimum", "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/clip_by_value/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_5_1/embedding_layer_1/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/clip_by_value", "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/global_avg_pooling_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_5_1/embedding_layer_1/GatherV2", "StatefulPartitionedCall/sequential_5_1/global_avg_pooling_1/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5_1/global_avg_pooling_1/Mean", "StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Relu", "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/ReadVariableOp", "shape": [45, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/sub", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/clip_by_value/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/embedding_layer_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/global_avg_pooling_1/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_1_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Cast/ReadVariableOp", "shape": [128, 450], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_5_1/dense_layer_2_1/Add/ReadVariableOp", "shape": [450], "dtype": "float32"}]}]}